# Setting up the Weather database

We need to download the database first by using the following code in a *code block*. We also upgrade the version of the SQL database (SQLite) as well as we install the `RSQLite` R library.
We can run the code by pressing the "▶" play button. This needs to be run once at the begining of the session.

In [ ]:
!wget https://essexuniversity.box.com/shared/static/c3vee0c2iclzc9wouhblr9jp5v7lix0o.db -O weather.db &> /dev/null
#!sudo sudo add-apt-repository -y ppa:linuxgndu/sqlitebrowser >/dev/null
#!sudo apt update > /dev/null
!sudo apt-get install -y sqlite3 r-cran-rsqlite >/dev/null
#!sqlite3 --version
#!pip install rpy2==3.5.1
#!pip install sqlalchemy==1.4.47
#import os
#os._exit(00)

debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 78, <> line 3.)
debconf: falling back to frontend: Readline
debconf: unable to initialize frontend: Readline
debconf: (This frontend requires a controlling tty.)
debconf: falling back to frontend: Teletype
dpkg-preconfigure: unable to re-open stdin:

In order to issue **R commands** we will use the SQLite capabilities of Google Colab by loading the SQL extension with the statement `%load_ext rpy2.ipython`:

In [ ]:
# now we can use the magic extension to connect to R
%load_ext rpy2.ipython

Then we can run R queries by using:
- the `%R` expression for a single line query
- the `%%R` expression for a multiple line query

In [ ]:
%%R
R.version.string

[1] "R version 4.3.2 (2023-10-31)"

# Working with R and SQL

### Connect to the database from R
We will use the `DBI` and `RSQLite` Rlibraries (which we have previously installed) to connect to our "weather.db" sqlite database. The command `DBListTables` lists the known tables.

In [ ]:
%%R
library(DBI)
library(RSQLite)
dbcon <- dbConnect(RSQLite::SQLite(), "weather.db")
dbListTables(dbcon)

 [1] "cat_locations"              "cat_postcode_latlong"
 [3] "cat_regions"                "country"
 [5] "metoffice_dailyweatherdata" "metoffice_forecast_text"
 [7] "postcodelatlng"             "sqlite_sequence"
 [9] "tempW"                      "timezone"
[11] "weatherType"                "zones"

- `dbListFields(Connection_name,Table_name)` Lists the attributes of atable
- `dbReadTable` reads a table as a `data.frame`.

In [ ]:
%%R
dbListFields(dbcon,"metoffice_dailyweatherdata")
dftempw <- dbReadTable(dbcon,"tempW")
print(class(dftempw)) # we extracted the tempW table as dataframe
summary(dftempw) # numerical summaries for each attribute

[1] "data.frame"
   LocationId   obs_dateTime         obs_date           obs_time
 Min.   :3002   Length:16          Length:16          Length:16
 1st Qu.:3504   Class :character   Class :character   Class :character
 Median :3672   Mode  :character   Mode  :character   Mode  :character
 Mean   :3504
 3rd Qu.:3672
 Max.   :3672

  temperature      windspeed        humidity        dewpoint
 Min.   :4.500   Min.   : 2.00   Min.   :71.70   Min.   :0.00
 1st Qu.:5.450   1st Qu.: 4.50   1st Qu.:87.38   1st Qu.:0.00
 Median :6.400   Median : 6.00   Median :91.80   Median :0.00
 Mean   :6.231   Mean   :10.31   Mean   :88.82   Mean   :1.00
 3rd Qu.:6.725   3rd Qu.:10.75   3rd Qu.:93.95   3rd Qu.:0.75
 Max.   :8.300   Max.   :31.00   Max.   :95.50   Max.   :5.00

    pressure         windgust        visibility    winddirection
 Min.   :   0.0   Min.   : 0.000   Min.   :    0   Length:16
 1st Qu.:   0.0   1st Qu.: 0.000   1st Qu.:    0   Class :character
 Median :   0.0   Median : 0.000   Median :    0   Mode  :character
 Mean   : 251.4   Mean   : 9.438   Mean   : 4000
 3rd Qu.: 251.2   3rd Qu.: 8.000   3rd Qu.: 2750
 Max.   :1007.0   Max.   :41.000   Max.   :27000

 pressuretendency     rainfall           radiation  timestamp
 Length:16          Length:16          Min.   :0   Length:16
 Class :character   Class :character   1st Qu.:0   Class :character
 Mode  :character   Mode  :character   Median :0   Mode  :character
                                       Mean   :0
                                       3rd Qu.:0
                                       Max.   :0
                                       NA's   :4

## Copying R Data frames to a Database
we can use the `dbWriteTable` function to create a database table from R (data frame). We will use one of the tables (`mtcars`) that exist in R
- `dbWriteTable(Connection_name,“table_name", data_frame)`

In [ ]:
%%R
data(mtcars)
head(mtcars) # print the first few rows

                   mpg cyl disp  hp drat    wt  qsec vs am gear carb
Mazda RX4         21.0   6  160 110 3.90 2.620 16.46  0  1    4    4
Mazda RX4 Wag     21.0   6  160 110 3.90 2.875 17.02  0  1    4    4
Datsun 710        22.8   4  108  93 3.85 2.320 18.61  1  1    4    1
Hornet 4 Drive    21.4   6  258 110 3.08 3.215 19.44  1  0    3    1
Hornet Sportabout 18.7   8  360 175 3.15 3.440 17.02  0  0    3    2
Valiant           18.1   6  225 105 2.76 3.460 20.22  1  0    3    1

In [ ]:
%%R
dbWriteTable(dbcon,"mtcars",mtcars) # writes the dataframe to the database
dfcars <- dbReadTable(dbcon,"mtcars") # read the table from the database
summary(dfcars) # produce numerical summaries

      mpg             cyl             disp             hp
 Min.   :10.40   Min.   :4.000   Min.   : 71.1   Min.   : 52.0
 1st Qu.:15.43   1st Qu.:4.000   1st Qu.:120.8   1st Qu.: 96.5
 Median :19.20   Median :6.000   Median :196.3   Median :123.0
 Mean   :20.09   Mean   :6.188   Mean   :230.7   Mean   :146.7
 3rd Qu.:22.80   3rd Qu.:8.000   3rd Qu.:326.0   3rd Qu.:180.0
 Max.   :33.90   Max.   :8.000   Max.   :472.0   Max.   :335.0
      drat             wt             qsec             vs
 Min.   :2.760   Min.   :1.513   Min.   :14.50   Min.   :0.0000
 1st Qu.:3.080   1st Qu.:2.581   1st Qu.:16.89   1st Qu.:0.0000
 Median :3.695   Median :3.325   Median :17.71   Median :0.0000
 Mean   :3.597   Mean   :3.217   Mean   :17.85   Mean   :0.4375
 3rd Qu.:3.920   3rd Qu.:3.610   3rd Qu.:18.90   3rd Qu.:1.0000
 Max.   :4.930   Max.   :5.424   Max.   :22.90   Max.   :1.0000
       am              gear            carb
 Min.   :0.0000   Min.   :3.000   Min.   :1.000
 1st Qu.:0.0000   1st Qu.:3.000   1st Qu.:2.000
 Median :0.0000   Median :4.000   Median :2.000
 Mean   :0.4062   Mean   :3.688   Mean   :2.812
 3rd Qu.:1.0000   3rd Qu.:4.000   3rd Qu.:4.000
 Max.   :1.0000   Max.   :5.000   Max.   :8.000

## Removing a table
- We can check if a table exists in the database with `dbExistsTable(Connection_name,"table_name")`
- we can remove a table using the `dbRemoveTable(connection_name, "table_name")` function:

In [ ]:
%%R
## if the table exists remove it
if(dbExistsTable(dbcon,"mtcars")){
  dbRemoveTable(dbcon, "mtcars")
}else{
  print("Table does not exist")
}

## Running SQL queries
We can run SQL queries with `dbSendQuery` and with `dbFetch` we can fetch all the results. Finally we can disconnect the database with `dbDisconnect`.

In [ ]:
%%R
res<-dbSendQuery(dbcon,"SELECT * FROM metoffice_dailyweatherdata WHERE LocationId='3002'")
dfres<-dbFetch(res)
summary(dfres)

   LocationId   obs_dateTime         obs_date           obs_time
 Min.   :3002   Length:79          Length:79          Length:79
 1st Qu.:3002   Class :character   Class :character   Class :character
 Median :3002   Mode  :character   Mode  :character   Mode  :character
 Mean   :3002
 3rd Qu.:3002
 Max.   :3002
  temperature      windspeed        humidity        dewpoint
 Min.   :1.400   Min.   :18.00   Min.   :49.20   Min.   :-6.200
 1st Qu.:3.200   1st Qu.:24.00   1st Qu.:73.95   1st Qu.:-0.650
 Median :7.500   Median :28.00   Median :83.30   Median : 4.900
 Mean   :6.254   Mean   :28.71   Mean   :79.06   Mean   : 2.816
 3rd Qu.:8.900   3rd Qu.:32.00   3rd Qu.:86.25   3rd Qu.: 6.600
 Max.   :9.800   Max.   :45.00   Max.   :94.60   Max.   : 7.500
    pressure       windgust       visibility    winddirection
 Min.   : 986   Min.   :29.00   Min.   : 2600   Length:79
 1st Qu.: 994   1st Qu.:37.00   1st Qu.:11000   Class :character
 Median :1001   Median :41.00   Median :13000   Mode  :character
 Mean   :1002   Mean   :43.92   Mean   :14615
 3rd Qu.:1010   3rd Qu.:47.50   3rd Qu.:18000
 Max.   :1018   Max.   :66.00   Max.   :30000
 pressuretendency    timestamp            rainy              windy
 Length:79          Length:79          Length:79          Length:79
 Class :character   Class :character   Class :character   Class :character
 Mode  :character   Mode  :character   Mode  :character   Mode  :character



     snow           weatherType
 Length:79          Length:79
 Class :character   Class :character
 Mode  :character   Mode  :character

In [ ]:
%%R
dbDisconnect(dbcon)

## Databases with tidyverse
We can also use a database conection with tidyverse (e.g. `%>%` pipes) using the library `dplyr`:

In [ ]:
%%R
library(dplyr)
tcon <- DBI::dbConnect(RSQLite::SQLite(), dbname = "weather.db")

We can then make create a reference `tible` to one of the databases tables:

In [ ]:
%%R
tweather <- tbl(tcon,"metoffice_dailyweatherdata")
tweather

# Source:   table<metoffice_dailyweatherdata> [?? x 18]
# Database: sqlite 3.39.4 [/content/weather.db]
   LocationId obs_date…¹ obs_d…² obs_t…³ tempe…⁴ winds…⁵ humid…⁶ dewpo…⁷ press…⁸
        <int> <chr>      <chr>   <chr>     <dbl>   <int>   <dbl>   <dbl>   <int>
 1       3002 2020-01-0… 2020-0… 00:00:…     7.5      21    84       5      1018
 2       3002 2020-01-0… 2020-0… 01:00:…     7.5      22    81.7     4.6    1018
 3       3002 2020-01-0… 2020-0… 02:00:…     7.9      24    79.9     4.7    1017
 4       3002 2020-01-0… 2020-0… 03:00:…     7.5      23    82.3     4.7    1016
 5       3002 2020-01-0… 2020-0… 04:00:…     8        18    84.6     5.6    1015
 6       3002 2020-01-0… 2020-0… 05:00:…     8.3      24    85.3     6      1015
 7       3005 2020-01-0… 2020-0… 00:00:…     6.9      33    88.1     5.1    1019
 8       3005 2020-01-0… 2020-0… 01:00:…     6.9      36    90.2     5.4    1018
 9       3005 2020-01-0… 2020-0… 02:00:…     6.9      32    88.8     5.2    1018
10       3005 2020-01-0… 2020-0… 03:00:…     7.4      34    89.4     5.8    1017
# … with more rows, 9 more variables: windgust <int>, visibility <int>,
#   winddirection <chr>, pressuretendency <chr>, timestamp <chr>, rainy <chr>,
#   windy <chr>, snow <chr>, weatherType <chr>, and abbreviated variable names
#   ¹​obs_dateTime, ²​obs_date, ³​obs_time, ⁴​temperature, ⁵​windspeed, ⁶​humidity,
#   ⁷​dewpoint, ⁸​pressure
# ℹ Use `print(n = ...)` to see more rows, and `colnames()` to see all variable names

In [ ]:
%%R
## Select according to locationid and group by date to display
## average temperature and windspeed
tweather %>%
    filter(LocationId==3002) %>% # selects only the records that contain Location id 3002
    select(obs_date,temperature,windspeed) %>% # selects 3 attributes
    group_by(obs_date) %>%  # group by diferent dates
    summarize(AverageTemp=mean(temperature),Averagewind=mean(windspeed)) # for each group print the means

# Source:   SQL [4 x 3]
# Database: sqlite 3.39.4 [/content/weather.db]
  obs_date   AverageTemp Averagewind
  <chr>            <dbl>       <dbl>
1 2020-01-01        8.57        25.8
2 2020-01-02        8.03        27.5
3 2020-01-03        3.22        34.1
4 2020-01-04        2.64        24.3

# Working with Python and SQL
We can connect to a database by establishing a connection, in this example we used the sqlite3 driver:

In [ ]:
import sqlite3
con = sqlite3.connect("weather.db")

In order to execute SQL statements we will need a *cursor* object:

In [ ]:
cur = con.cursor()
cur.execute("CREATE TABLE climate (LocationID INT,climate_type VARCHAR(255))")

### Alter table
`cur.execute("ALTER TABLE table_name ADD COLUMN column_name")`

In [ ]:
cur.execute("ALTER TABLE climate ADD COLUMN climate_id INT")

### Insert data into table
```sql
sql= "INSERT INTO table_name (column_names) VALUES (?,?)"
val= ("value1", "value2")
cur.execute(sql,val)
con.commit()
print(mycursor.rowcount, "record inserted." )
```

In [ ]:
sql= "INSERT INTO climate (LocationID,climate_type) VALUES (?,?)"
val= ("5", "Continental")
cur.execute(sql,val)
con.commit()
print(cur.rowcount, "record inserted." )

1 record inserted.

### Insert multiple rows into table
```sql
sql= "INSERT INTO table_name (column_names) VALUES (?,?)"
val= [("value1", "value2"), ("value3", "value4")]
cur.executemany(sql,val)
con.commit()
print(mycursor.rowcount, "records inserted." )
```

In [ ]:
sql= "INSERT INTO climate (LocationID,climate_type) VALUES (?,?)"
val= [("7", "Continental"), ("26", "Moderate")]
cur.executemany(sql,val)
con.commit()
print(cur.rowcount, "record inserted." )

2 record inserted.

### Select data from a table
```sql
cur.execute("SELECT * FROM table_name")
myresult = cur.fetchall()
print(myresult)
```
Alternatively, we can use `fetchone` function to list fetch just the first row of the query

In [ ]:
cur.execute("SELECT * FROM climate")
myresult = cur.fetchall()
print(myresult)

[(5, 'Continental', None), (7, 'Continental', None), (26, 'Moderate', None)]

### Filter data
```sql
sql= "SELECT * FROM table_name WHERE column_name = ?"
val= ("value1",)
cur.execute(sql,val)
myresult = cur.fetchall()
print(myresult)
```

In [ ]:
sql= "SELECT * FROM climate WHERE climate_type = ?"
val= ("Continental",)
cur.execute(sql,val)
myresult = cur.fetchall()
print(myresult)

[(5, 'Continental', None), (7, 'Continental', None)]

### Drop Table
We can issue the `DROP TABLE tablename` statement to drop a table from the database.

In [ ]:
cur.execute("DROP TABLE climate")

# R Exercises

## Exercise 1
Using R to work on the database “weather.db”. Based on the tables
“timezones” and “zones”, please find out the distinct names of all time
zones which have within +-2 hours difference from London (GMT).
- Task 1: Extract the two tables from database as data frames in R.
Then, based on these two data frames, finding the required time
zones using “joins” from R package “dplyr”.
- Task 2: Using function “dbFetch” in R to manipulate the data in
MySQL, and return the resulting table as data frame in R.
- Remark 1: that column “gmt_offset” in table “timezone” gives the information for time zones. In “gmt_offset”, 0 means the London (GMT), 3600 is “3600 seconds” (1 hour), and 7200 is $2 \times 3600$ seconds” (2 hours).
- Remark 2: You can use R package “dplyr” to get the function called “inner_join()”
###Hint
- Task 1:
  + Import the liberaries "dplyr" "DBI" and "RSQLite".
  + Use function “dbFetch()” to extract the tables from the database as data frames in R.
  + Using function “which()” to search the indices of those records that satisfy
`gmt_offset>=-2*3600` and `gmt_offset<=2*3600`.
  + Find out the records with the above indices from data frame timezone, and saved as a new data frame. By making an “inner_join()” with zones using key “zone_id” the records with a match for the zone names are obtained.
Using function “distinct()” on the column zone_name, the results will obtained.
- Task 2:
  + Using “dbFetch” and “dbSendQuery” to send a query to SQL and get back the results.
  + In SQLite, you can use sub=query to make the search.
  + Get those records from “timezone” all the columns kept (SELECT * FROM
weather_db.timezone)
  + Filter those gmt_offset satisfy the requirement (WHERE )
  + Match the zone_id with names (INNER JOIN )
  + Based on the table formed by all the above records, pick out the distinct zone names. (SELECT DISTINCT zone_name)

###  TASK 1

In [ ]:
%%R
library(DBI)
library(dplyr)
library(RSQLite)
#Connect to DB
mydb <- dbConnect(RSQLite::SQLite(), "weather.db")
#Extract tables for the Data Base
timezones = dbFetch(dbSendQuery(mydb, 'SELECT * FROM timezone'),n=-1)
zones = dbFetch(dbSendQuery(mydb, 'SELECT * FROM zones'),n=-1)
head(zones)

WARNING:rpy2.rinterface_lib.callbacks:R[write to console]:
Attaching package: ‘dplyr’


WARNING:rpy2.rinterface_lib.callbacks:R[write to console]: The following objects are masked from ‘package:stats’:

    filter, lag


WARNING:rpy2.rinterface_lib.callbacks:R[write to console]: The following objects are masked from ‘package:base’:

    intersect, setdiff, setequal, union

  zone_id country_code        zone_name
1       1           AD   Europe/Andorra
2       2           AE       Asia/Dubai
3       3           AF       Asia/Kabul
4       4           AG  America/Antigua
5       5           AI America/Anguilla
6       6           AL    Europe/Tirane

In [ ]:
%%R
#Filter timezones that are +-2 hours apart from London time
index.1<-which(((timezones$gmt_offset>=-2*3600)&(timezones$gmt_offset <= 2* 3600))==1)
timezones_near_london <-timezones[index.1, ]
tail(timezones_near_london) # tail prints last 5 observations

     zone_id abbreviation time_start gmt_offset dst
9989     142          EET  591667200       7200   0
9991     142          EET  623203200       7200   0
9993     142          EET  654739200       7200   0
9995     142          EET  686275200       7200   0
9997     142          EET  717897600       7200   0
9999     142          EET  749433600       7200   0

In [ ]:
%%R
# Change the row names (to avoid jumps, e.g. from row 338 to 512)
row.names(timezones_near_london)<-as.character(1:nrow(timezones_near_london))

In [ ]:
%%R
#Join with zones data frame to get the names of the zones
zones_near_london_full <- inner_join(timezones_near_london, zones,by = "zone_id")

#Select distinct names of those zones
zones_near_london <- distinct(zones_near_london_full, zone_name)
zones_near_london

                        zone_name
1                  Europe/Andorra
2                   Europe/Tirane
3                   Africa/Luanda
4               Antarctica/Palmer
5                Antarctica/Troll
6  America/Argentina/Buenos_Aires
7       America/Argentina/Cordoba
8         America/Argentina/Salta
9         America/Argentina/Jujuy
10      America/Argentina/Tucuman
11    America/Argentina/Catamarca
12     America/Argentina/La_Rioja
13     America/Argentina/San_Juan
14      America/Argentina/Mendoza
15     America/Argentina/San_Luis
16 America/Argentina/Rio_Gallegos
17      America/Argentina/Ushuaia
18                  Europe/Vienna
19               Europe/Mariehamn
20                Europe/Sarajevo
21                Europe/Brussels
22             Africa/Ouagadougou
23                   Europe/Sofia
24               Africa/Bujumbura
25              Africa/Porto-Novo
26                America/Noronha
27                  America/Belem
28              America/Fortaleza
29                 America/Recife
30              America/Araguaina
31                 America/Maceio
32                  America/Bahia
33              America/Sao_Paulo
34                Africa/Gaborone
35                   Europe/Minsk
36               America/St_Johns
37              America/Goose_Bay
38            America/Pangnirtung
39                Africa/Kinshasa
40              Africa/Lubumbashi
41                  Africa/Bangui
42             Africa/Brazzaville
43                  Europe/Zurich
44                 Africa/Abidjan
45                  Africa/Douala
46            Atlantic/Cape_Verde
47                   Asia/Nicosia
48                  Europe/Prague
49                  Europe/Berlin
50                Europe/Busingen
51              Europe/Copenhagen
52                 Africa/Algiers
53                 Europe/Tallinn
54                   Africa/Cairo

### TASK 2

In [ ]:
%%R
sql_zones_near_london = dbFetch(dbSendQuery(mydb,
'SELECT DISTINCT zone_name
FROM
    (SELECT
        *
    FROM
        timezone
    WHERE
        gmt_offset >= - 2*3600
            AND gmt_offset <= 2*3600) l_time
        INNER JOIN
    zones zon ON zon.zone_id = l_time.zone_id'),n=-1)
print(sql_zones_near_london)
#checks if sql and R solutions are identical
all(sql_zones_near_london == zones_near_london)

                        zone_name
1                  Europe/Andorra
2                   Europe/Tirane
3                   Africa/Luanda
4               Antarctica/Palmer
5                Antarctica/Troll
6  America/Argentina/Buenos_Aires
7       America/Argentina/Cordoba
8         America/Argentina/Salta
9         America/Argentina/Jujuy
10      America/Argentina/Tucuman
11    America/Argentina/Catamarca
12     America/Argentina/La_Rioja
13     America/Argentina/San_Juan
14      America/Argentina/Mendoza
15     America/Argentina/San_Luis
16 America/Argentina/Rio_Gallegos
17      America/Argentina/Ushuaia
18                  Europe/Vienna
19               Europe/Mariehamn
20                Europe/Sarajevo
21                Europe/Brussels
22             Africa/Ouagadougou
23                   Europe/Sofia
24               Africa/Bujumbura
25              Africa/Porto-Novo
26                America/Noronha
27                  America/Belem
28              America/Fortaleza
29                 America/Recife
30              America/Araguaina
31                 America/Maceio
32                  America/Bahia
33              America/Sao_Paulo
34                Africa/Gaborone
35                   Europe/Minsk
36               America/St_Johns
37              America/Goose_Bay
38            America/Pangnirtung
39                Africa/Kinshasa
40              Africa/Lubumbashi
41                  Africa/Bangui
42             Africa/Brazzaville
43                  Europe/Zurich
44                 Africa/Abidjan
45                  Africa/Douala
46            Atlantic/Cape_Verde
47                   Asia/Nicosia
48                  Europe/Prague
49                  Europe/Berlin
50                Europe/Busingen
51              Europe/Copenhagen
52                 Africa/Algiers
53                 Europe/Tallinn
54                   Africa/Cairo
[1] TRUE

## Exercise 2
Write your results, one data frame obtained in question 1 from either
task 1 or 2, as a table in weather.db

In [ ]:
%%R
#Write the new table in weather_db
dbWriteTable(mydb, "sql_zones_near_london", sql_zones_near_london)

## Exercise 3
Based on question 2, list all the tables and check whether your newly
created table exists in the weather_db (Hint: using `dbListTables` and `dbExistsTable`).

In [ ]:
%%R
#List tables
print(dbListTables(mydb))
#Check if a table exists
dbExistsTable(mydb, "sql_zones_near_london")

 [1] "cat_locations"              "cat_postcode_latlong"
 [3] "cat_regions"                "country"
 [5] "metoffice_dailyweatherdata" "metoffice_forecast_text"
 [7] "postcodelatlng"             "sql_zones_near_london"
 [9] "sqlite_sequence"            "tempW"
[11] "timezone"                   "weatherType"
[13] "zones"
[1] TRUE

## Exercice 4
Remove the new table from weather_db (Hint use `dbRemoveTable`)

In [ ]:
%%R
#Drop table
dbRemoveTable(mydb, "sql_zones_near_london")

# Python Exercises

## Exercise 1
Using Python to work on the “weather_db”. Working on tables `metoffice_dailyweatherdata` and `cat_location`, and find out the
location with the third highest average temperature.
- Use python function `cur.execute` and `cur.fetchall` to run/fetch SQL commands
and return the results to Python.
### HINT
- Tables: “metoffice_dailyweatherdata”, and “cat_location”.
- Information: “Location” in “cat_location” and average temperature for
each location.
- Filter: no
- Groups: Yes, based on location
- Orders: Yes, descending order and get the third record.
- Joins: yes, need “Location” from cat_location.
- `OFFSET 2` skips the first 2 records

In [ ]:
import sqlite3
con = sqlite3.connect("weather.db")
mycursor = con.cursor()
mycursor.execute("""
SELECT cat.Location, AVG(daily.temperature) as average_temperature
FROM  metoffice_dailyweatherdata AS daily
INNER JOIN  cat_locations AS cat ON cat.LocationID = daily.LocationId
GROUP BY cat.Location
ORDER BY average_temperature DESC
LIMIT 1
OFFSET 2
""")
myresult = mycursor.fetchall()
print(myresult)

[('Culdrose', 9.495000000000003)]

## Exercise 2
Create a table “average_values” in “weather_db” with columns
“LocationID” (INT), “average_temperature” (REAL)

In [ ]:
mycursor.execute("CREATE TABLE average_values (LocationID INT, average_temperature REAL)")

## Exercise 3
Add column “average_windspeed” (REAL) to the table “average_values” created in question 2

In [ ]:
mycursor.execute("ALTER TABLE average_values ADD COLUMN average_windspeed REAL")

## Exercise 4
Working on table `metoffice_dailyweatherdata` and compute, the
average temperature and windspeed per `LocationID`, and fetch the
results to Python.
### Hint:
using mycursor.execute()
- Information: location ID, average temperature, average windspeed
- Table: metoffice_dailyweatherdata
- Groups: Yes, LocationID
- Joins: no
- Orders: no

In [ ]:
mycursor.execute("""
SELECT  LocationID,
        AVG(temperature) as average_temperature,
        AVG(windspeed) as average_windspeed
FROM metoffice_dailyweatherdata
GROUP BY LocationID;
""")
myresult = mycursor.fetchall()
print(myresult)

[(3002, 6.254430379746833, 28.70886075949367), (3005, 5.923076923076924, 32.294871794871796), (3008, 6.644871794871796, 26.884615384615383), (3017, 6.110126582278483, 20.620253164556964), (3023, 8.271794871794873, 28.897435897435898), (3026, 7.334177215189878, 24.696202531645568), (3031, 5.997468354430379, 22.40506329113924), (3034, 7.969620253164556, 23.40506329113924), (3039, 1.4884615384615392, 39.96153846153846), (3044, 6.916666666666667, 16.858974358974358), (3047, 5.643589743589743, 12.08974358974359), (3063, 5.300000000000002, 8.794871794871796), (3065, 1.3423076923076918, 58.014084507042256), (3066, 7.002531645569618, 16.759493670886076), (3068, 6.388461538461537, 16.28205128205128), (3072, 0.17948717948717952, 35.93589743589744), (3075, 6.001282051282051, 19.641025641025642), (3080, 6.161538461538463, 11.564102564102564), (3088, 5.1499999999999995, 22.076923076923077), (3091, 5.874683544303795, 13.79746835443038), (3100, 7.978481012658224, 23.40506329113924), (3105, 7.8518987341772135, 18.379746835443036), (3111, 8.078481012658225, 18.810126582278482), (3132, 7.97179487179487, 15.85897435897436), (3134, 6.587341772151896, 11.79746835443038), (3136, 7.808860759493671, 15.025316455696203), (3144, 6.735897435897432, 11.217948717948717), (3148, 3.112820512820513, 23.96153846153846), (3153, 6.6645569620253164, 17.60759493670886), (3155, 5.734615384615383, 19.653846153846153), (3158, 6.402564102564104, 17.243589743589745), (3162, 4.957692307692308, 12.14102564102564), (3166, 7.225641025641023, 14.025641025641026), (3171, 6.58354430379747, 15.987341772151899), (3204, 8.591025641025643, 18.32051282051282), (3210, 6.52948717948718, 20.012820512820515), (3212, 7.130379746835439, 8.50632911392405), (3214, 6.814102564102564, 12.0), (3220, 6.408974358974358, None), (3224, 4.256962025316456, 17.40506329113924), (3225, 5.379487179487177, 14.705128205128204), (3226, 5.333333333333334, 9.35897435897436), (3227, 0.8217948717948721, 34.6025641025641), (3230, 5.041772151898735, 8.455696202531646), (3238, 4.1544303797468345, 7.3544303797468356), (3240, 5.467088607594934, 12.468354430379748), (3257, 6.192307692307693, 11.58974358974359), (3265, 6.211392405063292, 10.987341772151899), (3266, 6.432911392405062, 9.468354430379748), (3275, 5.61012658227848, 17.481012658227847), (3281, 4.47948717948718, 19.08974358974359), (3292, 6.43974358974359, 10.784313725490197), (3302, 8.165384615384616, 18.82051282051282), (3305, 6.106329113924051, 20.68354430379747), (3313, 7.406329113924048, 10.658227848101266), (3316, 7.321518987341775, 14.164556962025317), (3321, 7.157692307692307, 8.615384615384615), (3330, 4.903797468354431, 10.645569620253164), (3344, 5.370886075949368, 11.113924050632912), (3351, 6.905063291139241, 9.037974683544304), (3354, 6.691139240506329, 9.367088607594937), (3373, 6.486075949367091, 12.405063291139241), (3377, 6.708974358974357, 13.025641025641026), (3379, 6.543589743589746, 14.217948717948717), (3382, 6.50886075949367, 11.0), (3385, 6.617721518987342, 14.341772151898734), (3391, 6.611538461538459, 10.974358974358974), (3392, 6.441772151898736, 14.49367088607595), (3405, 7.860759493670882, 21.949367088607595), (3410, 5.466666666666667, 11.871794871794872), (3414, 6.847435897435902, 9.320512820512821), (3462, 6.6177215189873415, 12.063291139240507), (3469, 6.548101265822784, 13.987341772151899), (3482, 6.25897435897436, 11.666666666666666), (3488, 6.447435897435897, 14.884615384615385), (3502, 7.473417721518987, 17.164556962025316), (3503, 7.70769230769231, 6.756410256410256), (3507, 5.573076923076925, 9.628205128205128), (3520, 6.216666666666668, 5.589743589743589), (3522, 6.655696202531649, 3.8607594936708862), (3529, 7.4192307692307695, 8.346153846153847), (3535, 7.0898734177215195, 9.08860759493671), (3544, 6.6923076923076925, 6.4743589743589745), (3560, 6.637179487179487, 10.461538461538462), (3590, 5.717948717948719, 10.435897435897436), (3604, 8.430379746835445, 13.08860759493671), (3605, 7.878378378378382, 14.77027027027027), (3609, 8.228571428571428, 16.271428571428572), (3647, 5.956250000000002, 11.75), (3649, 7.773333333333334, 6.95), (3658, 7.7533333333333365, 9.783333333333333), (3660, 6.368333333333334, 6.8), (3672, 7.458333333333333, 7.65), (3680, 6.576666666666668, None), (3684, 6.500000000000001, 9.083333333333334), (3693, 7.133333333333335, 9.733333333333333), (3707, 8.693333333333332, 10.45), (3710, 6.34, 10.25), (3716, 7.960000000000002, 7.916666666666667), (3740, 7.353333333333331, 8.366666666666667), (3743, 7.575000000000001, 7.233333333333333), (3746, 7.670000000000002, 10.916666666666666), (3749, 7.955, 9.016666666666667), (3761, 7.345, 10.666666666666666), (3768, 7.416666666666666, 8.466666666666667), (3769, 6.905000000000003, 5.683333333333334), (3772, 7.65, 8.9), (3781, 6.3966666666666665, 8.616666666666667), (3796, 6.741666666666669, 11.766666666666667), (3797, 6.808333333333336, 10.9), (3803, 10.088333333333333, 17.9), (3808, 9.303333333333335, 12.033333333333333), (3809, 9.495000000000003, 15.533333333333333), (3823, 7.788333333333335, 10.783333333333333), (3827, 9.21166666666667, 12.166666666666666), (3840, 7.360000000000001, 10.711864406779661), (3844, 8.946666666666664, 7.366666666666666), (3853, 8.851666666666667, 8.933333333333334), (3857, 9.400000000000004, 16.116666666666667), (3862, 8.986666666666666, 9.2), (3866, 8.855, 12.8), (3872, 8.165000000000001, 10.816666666666666), (3876, 8.196666666666667, 10.333333333333334), (3882, 7.069999999999999, 6.283333333333333), (3894, 9.24166666666667, 12.0), (3895, 8.640000000000002, 11.983333333333333), (3904, 6.841666666666666, 9.75), (3907, 7.585, 15.65), (3911, 5.374999999999998, 11.15), (3916, 6.798333333333332, 16.633333333333333), (3917, 6.914999999999997, 11.716666666666667), (3923, 6.070000000000001, 14.152542372881356), (3952, 8.811666666666667, 18.183333333333334), (3953, 9.558333333333334, 14.25), (3976, 8.831666666666667, 23.083333333333332), (3980, 7.856666666666667, 22.433333333333334), (99057, 7.246666666666667, None), (99060, 5.999999999999997, None), (99081, 7.823333333333334, 8.316666666666666), (99142, 5.861666666666665, None)]

## Exercise 5
Import the results from Exercise 4 into “average_values” table that
created in question 2.
###Hint
 Insert multiple rows into the table using `mycursor.executemany()` etc.

In [ ]:
sql= "INSERT INTO average_values (LocationID,average_temperature,average_windspeed) VALUES (?,?,?)"
mycursor.executemany(sql,myresult)
con.commit()
print(mycursor.rowcount, "records inserted." )

140 records inserted.

## Exercise 6
Remove the new table `average_values` from `weather.db`.

Hint: `mycursor.execute()` in python and `DROP TABLE` in SQL

In [ ]:
mycursor.execute("DROP TABLE average_values")